[
  {
    "fileName": "agent-economies-synthetic-data",
    "date": "Jun 10",
    "readTime": "8",
    "title": "Olas Agent Economies Unleash Synthetic Data",
    "description": "The first agent economy, Olas Predict, shows agent economies will create value for users & synthetic data for training AI models & agents."
  },
  {
    "fileName": "agent-predictions-hackathon",
    "date": "Jul 19, 2023",
    "readTime": "1",
    "title": "Valory & Gnosis announce Crypto x AI Agent Hackathon",
    "description": "Valory and Gnosis launched the Agent Predictions Hackathon, enabling developers to learn and win prizes at the cutting edge of crypto and AI."
  },
  {
    "fileName": "alpine",
    "date": "Jan 25",
    "readTime": "4",
    "title": "Staker Expeditions: Alpine - Scaling New Heights in the Olas Ecosystem",
    "description": "Alpine, the second Staker Expedition, represents an exciting new phase in service staking within the Olas ecosystem, by Valory."
  },
  {
    "fileName": "announcing-a-successful-ceramic-network-grant-proposal",
    "date": "Jan 10, 2023",
    "readTime": "1",
    "title": "Announcing a successful Ceramic Network grant proposal",
    "description": "A new DAO coordination primitive We are excited to share our successful grant application through the Ceramic Network Grants Program to..."
  },
  {
    "fileName": "augment-hack",
    "date": "Jul 18, 2023",
    "readTime": "1",
    "title": "Valory Co-Organizes Crypto x AI Hackathon at ETHCC",
    "description": "Valory co-organized a decentralized AI Hackathon at ETHCC, with Ceramic, NEAR Protocol, Gnosis Chain, Ocean Protocol and StabilityAI."
  },
  {
    "fileName": "autonolas-whitepaper",
    "date": "Mar 10, 2023",
    "readTime": "2",
    "title": "Announcing the release of the Autonolas whitepaper.",
    "description": "Valory announces the Autonolas whitepaper - a comprehensive showcase Autonolas technology, tokenomics, use cases, and governance."
  },
  {
    "fileName": "autonomous-services-to-power-next-gen-apps-for-crypto-users-and-daos",
    "date": "Oct 11, 2022",
    "readTime": "4",
    "title": "Autonomous services to power next-gen apps for crypto users and DAOs",
    "description": "'Autonomy' is a buzzword used to sell everything from self-driving cars to image-generating AIs. Today, such apps are centrally owned."
  },
  {
    "fileName": "baby-degen-contest",
    "date": "Feb 7",
    "readTime": "3",
    "title": "Join the BabyDegen Alpha Challenge This Weekend!",
    "description": "Win Alpha access to your own autonomous AI agent on Solana, powered by Olas."
  },
  {
    "fileName": "c-suite-shuffle",
    "date": "Mar 21, 2023",
    "readTime": "2",
    "title": "Valory shuffles C-suite as early customers adopt Autonolas co-owned AI",
    "description": "The startup adjusts roles for its latest co-owned AI innovations, including a new SaaS platform to support Autonolas ecosystem growth."
  },
  {
    "fileName": "cantina-contest-solana",
    "date": "Jan 15",
    "readTime": "1",
    "title": "Strengthening Olas Security: Valory's $50k Prize Pool for Cantina Solana Audit of Olas",
    "description": "Strengthening Olas Security: Valory's $50k Prize Pool for Cantina Audit Contest of Olas Solana contracts."
  },
  {
    "fileName": "case-study-postmint-relies-on-olas-service-to-decentralize-and-automate-the-posttoearn-platform",
    "date": "Sep 4, 2023",
    "readTime": "1",
    "title": "Case Study: Postmint relies on Olas service to decentralize and automate the 'PostToEarn' platform",
    "description": "Postmint's Olas autonomous service showcases how Olas is ideal for building complex applications in crypto."
  },
  {
    "fileName": "centaurs-blazing-new-trails-in-ai-daos",
    "date": "May 19, 2023",
    "readTime": "1",
    "title": "Centaurs: Blazing New Trails in AI DAOs",
    "description": "Introducing Centaurs, a groundbreaking product within the Autonolas ecosystem that pioneers AI DAOs."
  },
  {
    "fileName": "co-owned-ai",
    "date": "Nov 23, 2023",
    "readTime": "5",
    "title": "The Argument for Co-ownership of Agentic AI",
    "description": "Valory believes Artificial General Intelligence will be agentic and must be co-owned. Explore AI Agents like Olas and join a rallying cry."
  },
  {
    "fileName": "code4rena",
    "date": "Dec 21, 2023",
    "readTime": "1",
    "title": "Strengthening Olas Security: Valory's $90k Prize Pool for Code4rena Audit Contest of Olas",
    "description": "Strengthening Olas Security: Valory's $90k Prize Pool for Code4Arena Audit Contest of Olas"
  },
  {
    "fileName": "contribute",
    "date": "Aug 9, 2023",
    "readTime": "1",
    "title": "Valory-built 'Contribute' enables Co-owned AI-ified Marketing",
    "description": "With the latest update, Valory-built 'Contribute' allows DAO members to co-own and AI-ify their marketing on-chain."
  },
  {
    "fileName": "crypto-x-ai-conf",
    "date": "Aug 21, 2023",
    "readTime": "1",
    "title": "Valory Crypto x AI Conference Series Gathers Industry-Leading Thinkers",
    "description": "Hundreds have tuned into Valory AG's Crypto x AI conferences, returning the next five-star, expert-studded line-up and discussions."
  },
  {
    "fileName": "dao-talk-podcast",
    "date": "May 3, 2023",
    "readTime": "1",
    "title": "Valory x DAO Talk Podcast Appearance",
    "description": "CEO David Minarsch is featured on DAO Talk, where they discuss the future of AI in crypto, using Tally for building Governatooorr and more!"
  },
  {
    "fileName": "from-academy-to-core",
    "date": "Sep 30, 2022",
    "readTime": "3",
    "title": "From Academy to Core",
    "description": "This is a guest post from Valory Software Engineer Ardian. Joining the Autonolas Academy In September of 2021, I heard about a new stack..."
  },
  {
    "fileName": "gnosis-and-safe-co-founders-recognize-olas-ai-agents-traction",
    "date": "Sep 29, 2023",
    "readTime": "1",
    "title": "Gnosis and Safe co-founders recognize Olas AI Agents' traction",
    "description": "Co-founder of Gnosis, Martin Köppelmann, and co-founder of Safe, Lukas Schor, made bold predictions about Olas AI Agents in crypto."
  },
  {
    "fileName": "governatooorr-ai-delegate",
    "date": "Oct 24, 2023",
    "readTime": "1",
    "title": "Governatooorr on Snapshot: Delegate to AI today, influence tomorrow",
    "description": "The AI Governance Delegate for DAOs supports Snapshot and is seeking holders of GNO, veBAL, SAFE, vCOW, LDO and UNI."
  },
  {
    "fileName": "governatooorr",
    "date": "Apr 5, 2023",
    "readTime": "5",
    "title": "Introducing Governatooorr: An Autonomous AI-powered Delegate for DAO Governance",
    "description": "A cutting-edge experiment in combining AI with Web3, offering a simple, robust, and extensible model for building AI-based apps."
  },
  {
    "fileName": "introducing-co-owned-ai",
    "date": "Mar 8, 2023",
    "readTime": "1",
    "title": "Introducing 'Co-owned AI' at ETHDenver",
    "description": "At Ethereum Denver 2023, our CEO David Minarsch introduced the idea of Co-owned AI."
  },
  {
    "fileName": "introducing-the-autonomous-fund",
    "date": "Nov 17, 2022",
    "readTime": "1",
    "title": "Introducing the Autonomous Fund",
    "description": "In this short blog post we'd like to introduce the concept of the “Autonomous Fund” at a high level. The spec and the repo will be linked..."
  },
  {
    "fileName": "machine-and-human-autonomy",
    "date": "Apr 19",
    "readTime": "7",
    "title": "Building Machine and Human Autonomy",
    "description": "Uniting a world-class remote team around a radical vision of human autonomy, enabling radical innovations in machine autonomy."
  },
  {
    "fileName": "mechs-nevermined",
    "date": "Dec 28, 2023",
    "readTime": "3",
    "title": "Building the Infrastructure for an Autonomous Future: Mechs and Flexible Agent Payments",
    "description": "Valory and Nevermined are collaborating to enhance Mechs with AI commerce solutions. Crypto's market for AI skills now supports dynamic, agent-friendly payment solutions."
  },
  {
    "fileName": "messari-recognizes-olas-as-core-infrastructure-for-onboarding-ai-agents-to-crypto",
    "date": "Oct 12, 2023",
    "readTime": "1",
    "title": "Messari recognizes Olas as core infrastructure for onboarding AI Agents to crypto",
    "description": "Messari recognizes the role AI Agents will play in crypto's future and highlights Olas as core infrastructure needed to onboard them."
  },
  {
    "fileName": "my-valory-internship-experience",
    "date": "Oct 26, 2022",
    "readTime": "2",
    "title": "My Valory Internship Experience",
    "description": "Chamundeshwari's experience as an intern at Valory AG from July to September of 2022."
  },
  {
    "fileName": "nevermined-mechs-launch",
    "date": "Feb 1",
    "readTime": "3",
    "title": "Advancing AI Commerce with Mechs Integration",
    "description": "Valory & Nevermined integrate Nevermined's decentralized AI commerce solutions into Mechs, the permissionless marketplace for AI skills."
  },
  {
    "fileName": "olas-assemble-announcing-a-community-events-grant-program",
    "date": "Jul 22",
    "readTime": "3",
    "title": "Olas Assemble: A Community Events Grant Program",
    "description": "Valory launches a community events grant program."
  },
  {
    "fileName": "olas-dev-kickstart-1-build-a-mech-tool-for-a-chance-to-start-earning-dev-rewards",
    "date": "May 8",
    "readTime": "3",
    "title": "Olas Dev Kickstart 1: Build a Mech Tool for a Chance to Start Earning Dev Rewards",
    "description": "We're excited to launch Olas Dev Kickstart! First session: Mech Tools. Build your Mech Prediction Tool for a chance to start earning rewards."
  },
  {
    "fileName": "olas-dev-kickstart-2-unlock-dev-rewards-in-a-three-day-workshop-on-mech-tools",
    "date": "Jun 25",
    "readTime": "3",
    "title": "Olas Dev Kickstart 2: Unlock Dev Rewards in a Three-Day Workshop on Mech Tools",
    "description": "Join us for Olas Dev Kickstart 2! Our 3-part workshop on July 2-4 at 1 pm UTC guides you in building a Mech Prediction Tool."
  },
  {
    "fileName": "olas-predict-leaderboard",
    "date": "Apr 17",
    "readTime": "3",
    "title": "Agents predict the future: unveiling the Olas Predict Leaderboard on HuggingFace",
    "description": "Olas Predict agent leaderboard shows 75% accuracy in future predictions translating into 450,000 transactions. Check it out today."
  },
  {
    "fileName": "olas-staker-expeditions",
    "date": "Oct 26, 2023",
    "readTime": "2",
    "title": "Olas Staker Expeditions",
    "description": "Valory's program for bootstrapping Service Staking in the Olas ocean of services, with three daring phases, powered by autonomous agent tech."
  },
  {
    "fileName": "open-call-the-autonolas-world-buildathon-with-prizes",
    "date": "Dec 21, 2021",
    "readTime": "3",
    "title": "Open Call: The Autonolas World Buildathon (with Prizes!)",
    "description": "The world of Alter Orbis needs you! We're the team behind Autonolas and we want you to join us in creating an epic new part of the..."
  },
  {
    "fileName": "pearl",
    "date": "May 21",
    "readTime": "1",
    "title": "Pearl: Stake an Agent. Earn Rewards.",
    "description": "Meet Pearl, an all-in-one application designed to streamline everyone's entry into autonomous AI agents & earning OLAS via staking."
  },
  {
    "fileName": "podcast-david-m-ceo-oaksprout-the-tan-cpo-make-daos-autonomous-again-on-chorus-one",
    "date": "May 11, 2022",
    "readTime": "1",
    "title": "Podcast: David M (CEO) & Oaksprout the Tan (CPO) 'Make DAOs Autonomous Again' on Chorus One",
    "description": "Podcast: David M (CEO) & Oaksprout the Tan (CPO) 'Make DAOs Autonomous Again' using Autonolas on Chorus One.",
    "youtubeId": "ucxwaJhBr20"
  },
  {
    "fileName": "podcast-david-m-on-protocol-deep-dives-w--thefett",
    "date": "Jun 6, 2023",
    "readTime": "1",
    "title": "Podcast: David M on protocol deep dives w/ thefett",
    "description": "Podcast: David M discusses crypto x AI, autonomous agents and Olas protocol on protocol deep dives w/ thefett.",
    "youtubeId": "oznC6JXb7EQ"
  },
  {
    "fileName": "podcast-david-m-on-the-fintech-blueprint-with-lex-sokolin",
    "date": "Jan 22",
    "readTime": "1",
    "title": "Podcast: David M on The Fintech Blueprint with Lex Sokolin",
    "description": "Understanding Olas - the $2bn autonomous agent network running on blockchain - with David Minarsch (CEO of Valory, co-creators of Olas)."
  },
  {
    "fileName": "podcast-in-plaintext",
    "date": "Dec 1, 2023",
    "readTime": "1",
    "title": "Podcast: David M on In Plaintext Podcast",
    "description": "How Olas is building the future of AI Agents, with David M (CEO of Valory, co-creators of Olas)."
  },
  {
    "fileName": "prediction-agent-hackathon-success",
    "date": "Oct 16, 2023",
    "readTime": "2",
    "title": "Prediction Agent Hackathon Success So Far",
    "description": "Olas Crypto x AI Agents predict real-world events on Gnosis Chain, collaborators add integrations, and hackers compete for prizes."
  },
  {
    "fileName": "propel-genie",
    "date": "Jul 10",
    "readTime": "3",
    "title": "Valory Unveils 'Propel Genie' at EthCC: Supercharging the Creation of  Agents for Olas & Beyond",
    "description": "Brussels, July 10, 2024 - Valory announced Propel Genie, an AI agent generates autonomous AI agents, promising 10x faster AI Agent Development."
  },
  {
    "fileName": "protocol-owned-services",
    "date": "Mar 31, 2023",
    "readTime": "2",
    "title": "How to Launch a DAO in a Decentralized Way: introducing Autonolas' Protocol-owned Services",
    "description": "Decentralized Autonomous Organizations (DAOs) are innovating. It was impossible to launch a DAO in a decentralized autonomous way… Until now."
  },
  {
    "fileName": "s-e-everest",
    "date": "Nov 1, 2023",
    "readTime": "6",
    "title": "Staker Expeditions: Everest - Embarking on the First Descent",
    "description": "Everest: first phase of Valory's program for bootstrapping Service Staking in the Olas ocean of services, powered by autonomous agent tech."
  },
  {
    "fileName": "smart-managed-pools-balancer-grant-approved",
    "date": "Aug 31, 2022",
    "readTime": "1",
    "title": "Smart Managed Pools: Balancer Grant Approved",
    "description": "Valory, the team creating Autonolas has made a successful application through the Balancer Grants program. If you'd like, you can view..."
  },
  {
    "fileName": "staker-expeditions-coastal",
    "date": "Apr 23",
    "readTime": "4",
    "title": "Staker Expeditions: Coastal - Expanding the Horizon",
    "description": "Valory's Staker Expeditions bootstrapping Olas Staking onboards the next stakers to Coastal, reaching phrase three: Coastal."
  },
  {
    "fileName": "talk-co-owned-ai-and-why-daos-are-its-primal-form-with-david-minarsch",
    "date": "Mar 3, 2023",
    "readTime": "1",
    "title": "Talk: Co-Owned AI - and why DAOs are its primal form with David Minarsch",
    "description": "David M, CEO of Valory, introduces what he coined as 'co-owned AI', why DAOs are its primal form and how Olas is vital infrastructure.",
    "youtubeId": "bmBnv2g-mR8"
  },
  {
    "fileName": "talk-crypto-x-ai-standards-david-minarsch-valory-ceo",
    "date": "Jun 7, 2023",
    "readTime": "1",
    "title": "Talk: Crypto x AI Standards - David Minarsch, Valory CEO",
    "description": "David Minarsch, CEO of Valory, co-creators of Autonolas, speaks at Valory's first Crypto x AI Mini Conference, on Crypto x AI Standards.",
    "youtubeId": "4pXC_ZDwMko"
  },
  {
    "fileName": "talk-david-galindo-cto-at-starknet",
    "date": "Feb 7, 2023",
    "readTime": "1",
    "title": "Talk: David Galindo, CTO - at StarkNet",
    "description": "David Galindo, CTO of Valory, co-creators of Autonolas, introduces how Autonolas can fill the gap in your web3 stack at Starknet's Decentral."
  },
  {
    "fileName": "talk-decentralized-off-chain-backends-how-autonolas-utilizes-ipfs-across-its-stack-david-m-ceo",
    "date": "Apr 24, 2023",
    "readTime": "1",
    "title": "Talk: Decentralized Off-chain Backends: How Autonolas utilizes IPFS across its stack - David M, CEO",
    "description": "In this talk, David M (CEO of Valory, co-creators of Autonolas) presents how Autonolas leverages IPFS to create an ideal stack for combining.",
    "youtubeId": "bzSjPTF-6G4"
  },
  {
    "fileName": "talk-oaksprout-the-tan-cpo-on-autonolas-enabling-cryptonative-dao-operations",
    "date": "May 21, 2022",
    "readTime": "1",
    "title": "Talk: Oaksprout the Tan, CPO, on Autonolas enabling Cryptonative DAO Operations",
    "description": "Oaksprout the Tan (CPO of Valory, co-creators of Autonolas), discusses how Autonolas enables cryptonative DAO operations.",
    "youtubeId": "oNNXlizKnYM"
  },
  {
    "fileName": "talk-oaksprout-the-tan-cpo-on-the-trends-in-modern-dao-treasury-management",
    "date": "Nov 14, 2022",
    "readTime": "1",
    "title": "Talk: Oaksprout the Tan, CPO, on the Trends in Modern DAO Treasury Management",
    "description": "Oaksprout the Tan (CPO of Valory, co-creators of Autonolas) discusses how Autonolas can provide cryptonative AIified DAO Treasury..."
  },
  {
    "fileName": "talk-oaksprout-the-tan-cpo-presents-the-first-autonomous-nft-collector-dao-at-nftberlin-2022",
    "date": "Jun 25, 2022",
    "readTime": "1",
    "title": "Talk: Oaksprout the Tan, CPO, presents the first Autonomous NFT Collector DAO, at NFTBERLIN 2022",
    "description": "In this talk Oaksprout the Tan, CPO of Valory, co-creators of Autonolas, presents El Collectooorr, the world's first autonomous NFT collector.",
    "youtubeId": "_m1jH-tCrOk"
  },
  {
    "fileName": "the-co-owned-ai-foundation",
    "date": "Apr 25",
    "readTime": "2",
    "title": "The Co-owned AI Foundation",
    "description": "Valory announces plans towards a Foundation to foster open-source development of co-owned AI."
  },
  {
    "fileName": "tokens-of-appreciation",
    "date": "Jan 25, 2022",
    "readTime": "4",
    "title": "Tokens of Appreciation",
    "description": "A guest post by Autonolas' Brand Visual Designer @kameha_san A Christmas surprise… Christmas — that time of the year when most companies..."
  },
  {
    "fileName": "trinity-web-ai-ux",
    "date": "Jan 26",
    "readTime": "5",
    "title": "The Trinity of Convergence - Co-ownable, Agentic AIs As Outcome Generators",
    "description": "How the three-part evolutions of the web, AI, and UX herald a new technological age."
  },
  {
    "fileName": "we-ve-hit-a-fork-in-the-road",
    "date": "Feb 8, 2022",
    "readTime": "3",
    "title": "We've hit a fork in the road!",
    "description": "We briefly explain why we decided to fork two of the projects which some of our co-founders have been contributing to for several years."
  }
]